Courses/7370/Lectures/Overview/index-keep.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-27 Fri 19:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DistrComp  Course Overview</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Mateti's Distributed Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2020-01-01 | <a href="../../">../../</a>
</div>
<div id="content">
<h1 class="title">DistrComp  Course Overview</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbf21401">1. Course Overview</a></li>
<li><a href="#orgcc433c2">2. Three Sample Lectures</a></li>
<li><a href="#orgc8ed96e">3. Concurrency Fundamentals</a></li>
<li><a href="#org2eae1b9">4. Survey of Prerequisites</a></li>
<li><a href="#orga1aa165">5. Home Work</a></li>
<li><a href="#org9b947b7">6. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbf21401" class="outline-2">
<h2 id="orgbf21401"><span class="section-number-2">1</span> Course Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>WSU CEG7370 <a href="https://cecs.wright.edu/~pmateti/Courses/7370/Top/">Distributed Computing</a> Course Home Page</li>

<li><a href="./syllabus.html">Syllabus</a> of the IIIT-Delhi version of this course</li>

<li><a href="../Projects/7370projects.html">Projects</a></li>

<li>Two exams. Most likely <a href="../../Exams/index.html">take-home</a>.  But, without searching the web or
whatever for answers.</li>

<li>No graded homework.  Implies that you will work on
various things on your own and discuss.</li>
<li><a href="https://piazza.com/wright/spring2020/ceg7370/home">Piazza</a> is our discussion platform.</li>
</ol>
</div>
</div>


<div id="outline-container-orgcc433c2" class="outline-2">
<h2 id="orgcc433c2"><span class="section-number-2">2</span> Three Sample Lectures</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>These are samples.  We will re-visit these topics for a full
exploration.</li>

<li>Distributed Computing Technology</li>
<li>Semantics of SemiColon, Parallel-Bar, and Vertical Bar</li>
<li>Mathematics of Concurrency</li>
</ol>
</div>

<div id="outline-container-org8cd075c" class="outline-3">
<h3 id="org8cd075c"><span class="section-number-3">2.1</span> Distributed Computing Technology</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Peer-to-peer computing vs Client-Server computing</li>
<li>Message passing v shared variables</li>
<li>RPC (Remote Procedure Call), RMI (Remote Method Invocation)</li>
<li><a href="../Projects/rpc-diag-tikz.pdf">../Projects/rpc-diag-tikz.pdf</a>  RPC/RMI Architecture</li>
<li><a href="../Projects/rpc-marshalling-tikz.pdf">../Projects/rpc-marshalling-tikz.pdf</a> Marshalling/Serializing of Data Structures</li>
</ol>
</div>
</div>


<div id="outline-container-org10df847" class="outline-3">
<h3 id="org10df847"><span class="section-number-3">2.2</span> Semantics of SemiColon, Parallel-Bar, and Vertical Bar</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Meaning of
<ol class="org-ol">
<li><code>S1 ;; S2</code></li>
<li><code>S1 || S2</code></li>
<li><code>S1 [] S2</code></li>
</ol></li>

<li><p>
Consider p60 of Andrew's Concurrent Programming [now using single
semicolon]
</p>
<div class="org-src-container">
<pre class="src src-SR">{ 
  y := 0; z := 0;
  co x := y + z 
  || {y := 1; z := 2}
  oc
}
</pre>
</div></li>

<li>Can x be 0, 1, 2 or 3 at the end of the above code?</li>
<li>We will have a lecture on <a href="../Fundas/semicolon-par-fat-bars.html">../Fundas/semicolon-par-fat-bars.html</a></li>
</ol>
</div>
</div>

<div id="outline-container-org545634e" class="outline-3">
<h3 id="org545634e"><span class="section-number-3">2.3</span> Mathematics of Concurrency</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><a href="../FormalMethods/assertions-slides.html">../FormalMethods/assertions-slides.html</a> This page is about
assertions, without concurrency related issues.</li>
<li><a href="../FormalMethods/math-of-concurrency.html">../FormalMethods/math-of-concurrency.html</a> Mathematics of Shared
Variables.  This page is about shared variable concurrency issues,
using mathematical logic.</li>
<li><a href="../FormalMethods/temporal-logic-slides.html">../FormalMethods/temporal-logic-slides.html</a> Classical mathematical
logic deals with timeless statements.  Classical logic cannot
express: "This basket will have 10 red balls."  Interesting
statements about processes depend on time.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgc8ed96e" class="outline-2">
<h2 id="orgc8ed96e"><span class="section-number-2">3</span> Concurrency Fundamentals</h2>
<div class="outline-text-2" id="text-3">
<p>
​
</p>
<ol class="org-ol">
<li>We are picky about our terms.</li>
<li>Ex: "Process"
<ol class="org-ol">
<li>All the following are conceptually the same: process, thread,
task, job, &#x2026;</li>
<li>On a given platform (e.g., Linux): process v thread v &#x2026; are different</li>
<li>By def: a single process is sequential</li>
</ol></li>

<li>Muliprocess v Multiprocessor v Multi-core: Same? Similar?</li>
</ol>
</div>

<div id="outline-container-orgfb84b40" class="outline-3">
<h3 id="orgfb84b40"><span class="section-number-3">3.1</span> Concurrency Fundamentals #2: Non-Determinacy</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Ex: Consider the simple assignment statement x := 3 [] 7 (Note
the fat-bar)
<ol class="org-ol">
<li>What is the value of x?</li>
<li>Either 3 or 7; guaranteed nothing else.</li>
<li>But which? When is it 3? When is it 7?</li>
<li>Code following the line above, better be prepared for either
value.</li>
</ol></li>
<li>Computation C is non-determinant: Each time we run, the result of C
may
change "for no good reason."  Why? Because "non-determinacy" is
baked in.</li>
</ol>
</div>
</div>

<div id="outline-container-orgc7706b6" class="outline-3">
<h3 id="orgc7706b6"><span class="section-number-3">3.2</span> Concurrency Fundamentals #3: Meta Terminology</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Fundamentals v Principles v Foundations</li>
<li>Concurrency Fundamentals constitute the core of this course.</li>
<li>Until the last week of this course, we will use "concurrency" as a
term covering all of networked-, parallel-, distributed- computing.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org2eae1b9" class="outline-2">
<h2 id="org2eae1b9"><span class="section-number-2">4</span> Survey of Prerequisites</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="../Overview/survey.html">Survey of Prerequisites</a></li>
<li>We will try to fill you in on most of the prerequisites. The survey
is for that purpose. In some ways it may be better that you have
not heard of some of these things.</li>
<li>Post on Piazza this survey answered in detail.</li>
</ol>
</div>
</div>


<div id="outline-container-orga1aa165" class="outline-2">
<h2 id="orga1aa165"><span class="section-number-2">5</span> Home Work</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Learn the Mine Sweeper game.  Imagine each cell is a computer
system.  A cell talks to others only through message passing.  How
do we program it?</li>
<li>Study today's lecture.</li>
<li>Enroll and post on Piazza the <a href="../Overview/survey.html">Survey of Prerequisites</a> answered in
some detail.</li>
</ol>
</div>
</div>

<div id="outline-container-org9b947b7" class="outline-2">
<h2 id="org9b947b7"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<p>
Reading list for this course is a transitive closure starting from the
ones linked on the course home page. Items marked as Require Reading
are sources for exam questions. Other items do enhance your
understanding, but, if you are not aiming for an A, you may skip.
</p>
</div>

<div id="outline-container-org99e5fa3" class="outline-3">
<h3 id="org99e5fa3"><span class="section-number-3">6.1</span> References #1</h3>
<div class="outline-text-3" id="text-6-1">
<ol class="org-ol">
<li>I will list specific chapters from Recommended Books later.</li>

<li>Gregory R. Andrews, Concurrent Programming: Principles and
Practice, Benjamin/Cummings, 1991.  {pm: This <b>is</b> our text book.
A classic.  We will do Chapters 1 and 2 much later in our course. }</li>

<li>Also see his revision of the above book.
<a href="./andrews-multithreaded-toc.html">./andrews-multithreaded-toc.html</a> {We will note Excluded chapters and
sections.  We do cover things not included in this book.}</li>
</ol>
</div>
</div>

<div id="outline-container-orgb682ede" class="outline-3">
<h3 id="orgb682ede"><span class="section-number-3">6.2</span> References #2</h3>
<div class="outline-text-3" id="text-6-2">
<ol class="org-ol">
<li>M. Ben-Ari, Principles of Concurrent and Distributed Programming,
Addison-Wesley/Pearson, 2006.  {Another classic.}</li>

<li>George Coulouris, Jean Dollimore, Tim Kindberg, and Gordon Blair,
Distributed Systems: Concepts and Design, 2011.  {Systems as
opposed to principles, and foundations.}</li>

<li>Other references listed in lectures.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 &bull; <a href=mailto:pmateti@iiitd.ac.in>pmateti@iiitd.ac.in</a> &bull; 2020-01-01
</div>
</body>
</html>
